src/InformationRegisters/Инциденты/Инциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Инциденты</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееСрабатывание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатываний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформационнаяБаза</name>
    <comment>Инфобаза или название счетчика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кластер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПодробноеСообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРеакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НеОповещатьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПроигнорироватьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОткрытияПовторная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатыванийПовторное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникИнцидента</name>
    <type>
      <types>CatalogRef.ОбнаружениеИнцидентовОперативное</types>
      <types>String</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
      <types>CatalogRef.ГруппыСчетчиков</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НавигационнаяСсылкаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеНавигационнойСсылкиИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>CatalogRef.Инциденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/HTTPServices/InputIncidentTickets/Module.bsl
Функция OpenPOST(Запрос)
	
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
		Поток = Новый ЧтениеXML();
		Поток.УстановитьСтроку(ТелоЗапроса);
		Инцидент = ФабрикаXDTO.ПрочитатьXML(Поток);
		Поток.Закрыть();
		
		Если Инцидент.Свойства().Получить("Type")=неопределено Тогда
			ВызватьИсключение "Не указан тип (Type) инцидента";
		КонецЕсли;
		
		Если Инцидент.Свойства().Получить("Id")=неопределено Тогда
			ВызватьИсключение "Не указан код (Id) инцидента";
		КонецЕсли;
		
		Если Инцидент.Свойства().Получить("Message")=неопределено Тогда
			ВызватьИсключение "Не указано сообщение (Message) инцидента";
		КонецЕсли;
        
        Если Инцидент.Свойства().Получить("Infobase") = Неопределено Тогда
            ИнформационнаяБаза = "";
        Иначе
            ИнформационнаяБаза =  Инцидент["Infobase"];
        КонецЕсли;
        
		Если ТипЗнч(ИнформационнаяБаза) = Тип("ОбъектXDTO") Тогда
			ИнформационнаяБаза = Неопределено;
		КонецЕсли;
        
        Если Инцидент.Свойства().Получить("Cluster") = Неопределено Тогда
            Кластер = "";
        Иначе
            Кластер =  Инцидент["Cluster"];
        КонецЕсли;
        
        Если Инцидент.Свойства().Получить("Count") = Неопределено Тогда
            ЧислоСрабатываний = 1;
        Иначе
            ЧислоСрабатываний = Число(Инцидент.Count);
        КонецЕсли;
        
		ИнцидентыСервер.ОткрытьИнцидент(Инцидент.Type, Инцидент.Id, ИнформационнаяБаза, Кластер, Инцидент.Message, ЧислоСрабатываний);
				
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;
		
	Исключение
		
		ОбъектОшибки = ИнформацияОбОшибке();
		
		ЗаписьЖурналаРегистрации("InputIncidentTickets.Open", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ОбъектОшибки));
		
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("<html><body>" + КраткоеПредставлениеОшибки(ОбъектОшибки) + "</body><html>"); //!! экранировать символы
        
		Возврат Ответ;
		
	КонецПопытки;
	
КонецФункции

Функция ClosePOST(Запрос)
	
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
        
        Если СтрНайти(ТелоЗапроса, "<IncidentClose xmlns=""http://www.1c.ru/1cFresh/Incidents/") = 1 Тогда
            
            Поток = Новый ЧтениеXML();
            Поток.УстановитьСтроку(ТелоЗапроса);
            Инцидент = ФабрикаXDTO.ПрочитатьXML(Поток);
            Поток.Закрыть();
            
            Если Инцидент.Свойства().Получить("Type")=неопределено Тогда
                ВызватьИсключение "Не указан тип (Type) инцидента";
            КонецЕсли;
            
            Если Инцидент.Свойства().Получить("Id")=неопределено Тогда
                ВызватьИсключение "Не указан код (Id) инцидента";
            КонецЕсли;
            
            ИнцидентыСервер.ЗакрытьИнцидент(Инцидент.Type, Инцидент.Id, Истина);
            
            Ответ = Новый HTTPСервисОтвет(200);
        Иначе
            CloseByCode(ТелоЗапроса);
            Ответ = Новый HTTPСервисОтвет(200);
        КонецЕсли;
        
		Возврат Ответ;
	
	Исключение
		
		ОбъектОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("InputIncidentTickets.Close", 
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ОбъектОшибки)
		);
		
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("<html><body>" + КраткоеПредставлениеОшибки(ОбъектОшибки) + "</body><html>"); //!! экранировать символы
		Возврат Ответ;
		
	КонецПопытки;
	
КонецФункции

Функция DefineTypePOST(Запрос)
	
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
		Поток = Новый ЧтениеXML();
		Поток.УстановитьСтроку(ТелоЗапроса);
		ТипИнцидента = ФабрикаXDTO.ПрочитатьXML(Поток);
		Поток.Закрыть();
		
		_УровеньИнцидента = ПредопределенноеЗначение("Перечисление.УровниИнцидентов." + ТипИнцидента.Level);
		_Теги = ?(ТипИнцидента.Свойства().Получить("Tags")=неопределено, "", ТипИнцидента["Tags"]);
		Результат = ИнцидентыСервер.ОпределитьТипИнцидента(ТипИнцидента.Type, _УровеньИнцидента, ТипИнцидента.Subsystem);
		
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;
	
	Исключение
		
		ОбъектОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("InputIncidentTickets.DefineType", УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ОбъектОшибки));
		
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("<html><body>" + КраткоеПредставлениеОшибки(ОбъектОшибки) + "</body><html>"); //!! экранировать символы
		Возврат Ответ;
		
	КонецПопытки;
		
КонецФункции

Процедура CloseByCode(КодИнцидента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   РегИнциденты.Инцидент,
    |   РегИнциденты.ТипИнцидента
    |ИЗ
    |   РегистрСведений.Инциденты КАК РегИнциденты
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Инциденты КАК СпрИнциденты
    |ПО
    |   СпрИнциденты.Ссылка = РегИнциденты.Инцидент
    |   И СпрИнциденты.Наименование = &КодИнцидента
    |";
    
    Запрос.УстановитьПараметр("КодИнцидента", КодИнцидента);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        ИнцидентыСервер.ЗакрытьИнцидент(Выборка.ТипИнцидента, Выборка.Инцидент, Истина);
    КонецЦикла;
    
КонецПроцедуры
